; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph0 - mode
	infrared2 - mode
	image1 - mode
	Star3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument5 infrared2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument6 image1)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite4 Phenomenon5)
	(have_image Planet4 image1)
	(have_image Phenomenon5 image1)
	(have_image Planet7 image1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 spectrograph0)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 infrared2)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 11
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 11
3. (calibrate satellite2 instrument5 star1)
   added: (calibrated instrument5)
   goals met: 0 of 11
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 11
5. (turn_to satellite4 phenomenon5 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 phenomenon5)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon14 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 11
7. (take_image satellite2 phenomenon14 instrument5 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 11
8. (turn_to satellite2 phenomenon5 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 11
9. (take_image satellite2 phenomenon5 instrument5 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 11
10. (turn_to satellite2 planet13 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet13)
   goals met: 3 of 11
11. (take_image satellite2 planet13 instrument5 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 4 of 11
12. (turn_to satellite2 planet4 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet4)
   goals met: 4 of 11
13. (take_image satellite2 planet4 instrument5 image1)
   added: (have_image planet4 image1)
   goals met: 5 of 11
14. (turn_to satellite2 planet7 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 planet7)
   goals met: 5 of 11
15. (take_image satellite2 planet7 instrument5 image1)
   added: (have_image planet7 image1)
   goals met: 6 of 11
16. (turn_to satellite1 star3 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star3)
   goals met: 6 of 11
17. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 6 of 11
18. (turn_to satellite1 phenomenon10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 11
19. (take_image satellite1 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 7 of 11
20. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 11
21. (take_image satellite1 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 8 of 11
22. (turn_to satellite1 planet11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet11)
   goals met: 8 of 11
23. (take_image satellite1 planet11 instrument2 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 9 of 11
24. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 9 of 11
25. (take_image satellite1 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 10 of 11
26. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 11 of 11
